package com.eomcs.lang.ex05;

//# 비트 이동 연산자 : 응용 I
//
public class Exam0440 {
  public static void main(String[] args) {

    // i 변수에 들어있는 값을 순서대로 1바이트씩 잘라서
    // a,b,c,d 변수에 넣은 다음 각 변수의 값을 16진수로 출력하라!
    // 특정 숫자만 추출하고 싶을 때 사용함
    // int y = 0x27a130ff;
    // int x = 0; y의 각 바이트를 뒤집어서 x에 담아라.
    // -> 이런 알고리즘 4년차부터 공부해서 카카오나 구글에 지원하라!
    int i = 0x27a130ff;
    int a, b, c, d;

    System.out.println(i);
    System.out.println(Integer.toHexString(i));


    // [00100111_10100001_00110000_11111111] => 27a130ff

    a = i >> 24;
    // 32비트 중에서 앞의 8비트빼고 24비트를 없애기 위해 사용
    // [00000000_00000000_00000000_00100111]_10100001_00110000_11111111

    b = i >> 16 & 0xff;
    //  [00100111_10100001_00110000_11111111] => 27a130ff
    //            -------- 만 추출하기
    //  [00000000_00000000_00100111_10100001]_00110000_11111111
    //   00000000_00000000_00100111_10100001  => 0x000027a1
    // & 00000000_00000000_00000000_11111111  => 0x000000ff
    // &에서 0은 다 없애는 기능을 한다
    // --------------------------------------
    //   00000000_00000000_00000000_10100001

    c = i >> 8 & 0xff;
    //  [00100111_10100001_00110000_11111111] => 27a130ff
    //                     -------- 만 추출하기
    //  [00000000_00100111_10100001_00110000]_11111111
    //   00000000_00100111_10100001_00110000  => 0x0027a130
    // & 00000000_00000000_00000000_11111111  => 0x000000ff
    // --------------------------------------
    //   00000000_00000000_00000000_00110000

    d = i & 0xff;
    //  [00100111_10100001_00110000_11111111] => 27a130ff
    //                              -------- 만 추출하기
    //  [00100111_10100001_00110000_11111111]
    //   00100111_10100001_00110000_11111111  => 0x27a130ff
    // & 00000000_00000000_00000000_11111111  => 0x000000ff
    // --------------------------------------
    //   00000000_00000000_00000000_11111111

    System.out.println(Integer.toHexString(a));
    System.out.println(Integer.toHexString(b));
    System.out.println(Integer.toHexString(c));
    System.out.println(Integer.toHexString(d));


  }
}
